knieriem/tinygo-stm32-svd/svd/stm32h7s.svd
        <register>
          <name>DOR</name>
          <displayName>DOR</displayName>
          <description>JPEG data output register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATAOUT</name>
              <description>Data output FIFO
Output FIFO data register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-15</dimIndex>
          <name>QMEM0%s</name>
          <displayName>QMEM0_%s</displayName>
          <description>JPEG quantization memory 0</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>QCOEF0</name>
              <description>Quantization coefficient 0
8-bit quantization coefficient.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QCOEF1</name>
              <description>Quantization coefficient 1
8-bit quantization coefficient.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QCOEF2</name>
              <description>Quantization coefficient 2
8-bit quantization coefficient.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QCOEF3</name>
              <description>Quantization coefficient 3
8-bit quantization coefficient.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-15</dimIndex>
          <name>QMEM1%s</name>
          <displayName>QMEM1_%s</displayName>
          <description>JPEG quantization memory 1</description>
          <addressOffset>0x90</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>QCOEF0</name>
              <description>Quantization coefficient 0
8-bit quantization coefficient.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QCOEF1</name>
              <description>Quantization coefficient 1
8-bit quantization coefficient.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QCOEF2</name>
              <description>Quantization coefficient 2
8-bit quantization coefficient.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QCOEF3</name>
              <description>Quantization coefficient 3
8-bit quantization coefficient.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-15</dimIndex>
          <name>QMEM2%s</name>
          <displayName>QMEM2_%s</displayName>
          <description>JPEG quantization memory 2</description>
          <addressOffset>0xD0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>QCOEF0</name>
              <description>Quantization coefficient 0
8-bit quantization coefficient.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QCOEF1</name>
              <description>Quantization coefficient 1
8-bit quantization coefficient.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QCOEF2</name>
              <description>Quantization coefficient 2
8-bit quantization coefficient.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QCOEF3</name>
              <description>Quantization coefficient 3
8-bit quantization coefficient.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>16</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-15</dimIndex>
          <name>QMEM3%s</name>
          <displayName>QMEM3_%s</displayName>
          <description>JPEG quantization memory 3</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>QCOEF0</name>
              <description>Quantization coefficient 0
8-bit quantization coefficient.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QCOEF1</name>
              <description>Quantization coefficient 1
8-bit quantization coefficient.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QCOEF2</name>
              <description>Quantization coefficient 2
8-bit quantization coefficient.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>QCOEF3</name>
              <description>Quantization coefficient 3
8-bit quantization coefficient.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <cluster>
          <dim>4</dim>
          <dimIncrement>0x10</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>HUFFMIN%s</name>
          <description>HUFFMIN cluster: 100-bit minimum Huffman value</description>
          <addressOffset>0x150</addressOffset>
          <register>
            <name>HUFFMIN_0</name>
            <displayName>HUFFMIN0_0</displayName>
            <description>Bits 0-31 of the minimum Huffman value</description>
            <addressOffset>0x0</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA0</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HUFFMIN_1</name>
            <displayName>HUFFMIN0_1</displayName>
            <description>Bits 32-63 of the minimum Huffman value</description>
            <addressOffset>0x4</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA0</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HUFFMIN_2</name>
            <displayName>HUFFMIN0_2</displayName>
            <description>Bits 64-95 of the minimum Huffman value</description>
            <addressOffset>0x8</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA0</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>32</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
          <register>
            <name>HUFFMIN_3</name>
            <displayName>HUFFMIN0_3</displayName>
            <description>Bits 96-99 of the minimum Huffman value</description>
            <addressOffset>0xC</addressOffset>
            <size>0x20</size>
            <resetValue>0x00000000</resetValue>
            <resetMask>0x00000000</resetMask>
            <fields>
              <field>
                <name>DATA0</name>
                <description>Minimum Huffman value
100-bit minimum Huffman value used internally by the JPEG decoder.</description>
                <bitOffset>0</bitOffset>
                <bitWidth>4</bitWidth>
                <access>read-write</access>
              </field>
            </fields>
          </register>
        </cluster>
        <register>
          <dim>32</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-31</dimIndex>
          <name>HUFFBASE%s</name>
          <displayName>HUFFBASE%s</displayName>
          <description>JPEG Huffman base</description>
          <addressOffset>0x190</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Data 0
Base Huffman value.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Data 1
Base Huffman value.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>84</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-83</dimIndex>
          <name>HUFFSYMB%s</name>
          <displayName>HUFFSYMB%s</displayName>
          <description>JPEG Huffman symbol</description>
          <addressOffset>0x210</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Data 0
Huffman symbol.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Data 1
Huffman symbol.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA2</name>
              <description>Data 2
Huffman symbol.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA3</name>
              <description>Data 3
Huffman symbol.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>103</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-102</dimIndex>
          <name>DHTMEM%s</name>
          <displayName>DHTMEM%s</displayName>
          <description>JPEG DHT memory</description>
          <addressOffset>0x360</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>DATA0</name>
              <description>Huffman table data 0
Huffman table data for DHT marker segment generation.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA1</name>
              <description>Huffman table data 1
Huffman table data for DHT marker segment generation.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA2</name>
              <description>Huffman table data 2
Huffman table data for DHT marker segment generation.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DATA3</name>
              <description>Huffman table data 3
Huffman table data for DHT marker segment generation.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>88</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-87</dimIndex>
          <name>HUFFENC_AC0%s</name>
          <displayName>HUFFENC_AC0_%s</displayName>
          <description>JPEG encoder, AC Huffman table 0</description>
          <addressOffset>0x500</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE0</name>
              <description>Huffman code 0
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN0</name>
              <description>Huffman length 0
Number of bits in the Huffman code HCODE0 minus 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE1</name>
              <description>Huffman code 1
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN1</name>
              <description>Huffman length 1
Number of bits in the Huffman code HCODE1 minus 1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>88</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-87</dimIndex>
          <name>HUFFENC_AC1%s</name>
          <displayName>HUFFENC_AC1_%s</displayName>
          <description>JPEG encoder, AC Huffman table 1</description>
          <alternateRegister>HUFFENC_AC0_55</alternateRegister>
          <addressOffset>0x5DC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE0</name>
              <description>Huffman code 0
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN0</name>
              <description>Huffman length 0
Number of bits in the Huffman code HCODE0 minus 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE1</name>
              <description>Huffman code 1
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN1</name>
              <description>Huffman length 1
Number of bits in the Huffman code HCODE1 minus 1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>HUFFENC_DC0%s</name>
          <displayName>HUFFENC_DC0_%s</displayName>
          <description>JPEG encoder, DC Huffman table 0</description>
          <addressOffset>0x7C0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE0</name>
              <description>Huffman code 0
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN0</name>
              <description>Huffman length 0
Number of bits in the Huffman code HCODE0 minus 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE1</name>
              <description>Huffman code 1
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN1</name>
              <description>Huffman length 1
Number of bits in the Huffman code HCODE1 minus 1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>8</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-7</dimIndex>
          <name>HUFFENC_DC1%s</name>
          <displayName>HUFFENC_DC1_%s</displayName>
          <description>JPEG encoder, DC Huffman table 1</description>
          <addressOffset>0x89C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x00000000</resetMask>
          <fields>
            <field>
              <name>HCODE0</name>
              <description>Huffman code 0
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN0</name>
              <description>Huffman length 0
Number of bits in the Huffman code HCODE0 minus 1.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HCODE1</name>
              <description>Huffman code 1
8 least significant bits of the Huffman code.
If the Huffman code is less than 8 bits long, the unused bits must be 0.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>HLEN1</name>
              <description>Huffman length 1
Number of bits in the Huffman code HCODE1 minus 1.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
