knieriem/tinygo-stm32-svd/svd/stm32h7s.svd
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>MKEYR%s</name>
          <displayName>MKEYR%s</displayName>
          <description>MCE master key %s</description>
          <addressOffset>0x200</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MKEY0</name>
              <description>Master key bit 0
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY1</name>
              <description>Master key bit 1
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY2</name>
              <description>Master key bit 2
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY3</name>
              <description>Master key bit 3
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY4</name>
              <description>Master key bit 4
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY5</name>
              <description>Master key bit 5
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY6</name>
              <description>Master key bit 6
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY7</name>
              <description>Master key bit 7
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY8</name>
              <description>Master key bit 8
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY9</name>
              <description>Master key bit 9
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY10</name>
              <description>Master key bit 10
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY11</name>
              <description>Master key bit 11
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY12</name>
              <description>Master key bit 12
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY13</name>
              <description>Master key bit 13
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY14</name>
              <description>Master key bit 14
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY15</name>
              <description>Master key bit 15
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY16</name>
              <description>Master key bit 16
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY17</name>
              <description>Master key bit 17
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY18</name>
              <description>Master key bit 18
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY19</name>
              <description>Master key bit 19
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY20</name>
              <description>Master key bit 20
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY21</name>
              <description>Master key bit 21
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY22</name>
              <description>Master key bit 22
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY23</name>
              <description>Master key bit 23
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY24</name>
              <description>Master key bit 24
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY25</name>
              <description>Master key bit 25
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY26</name>
              <description>Master key bit 26
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY27</name>
              <description>Master key bit 27
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY28</name>
              <description>Master key bit 28
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY29</name>
              <description>Master key bit 29
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY30</name>
              <description>Master key bit 30
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>MKEY31</name>
              <description>Master key bit 31
This key is used by the MCE block cipher in normal, SCA resistant mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <dim>4</dim>
          <dimIncrement>0x4</dimIncrement>
          <dimIndex>0-3</dimIndex>
          <name>FMKEYR%s</name>
          <displayName>FMKEYR%s</displayName>
          <description>MCE fast master key %s</description>
          <addressOffset>0x220</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMKEY0</name>
              <description>Fast master key bit 0
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY1</name>
              <description>Fast master key bit 1
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY2</name>
              <description>Fast master key bit 2
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY3</name>
              <description>Fast master key bit 3
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY4</name>
              <description>Fast master key bit 4
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY5</name>
              <description>Fast master key bit 5
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY6</name>
              <description>Fast master key bit 6
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY7</name>
              <description>Fast master key bit 7
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY8</name>
              <description>Fast master key bit 8
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY9</name>
              <description>Fast master key bit 9
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY10</name>
              <description>Fast master key bit 10
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY11</name>
              <description>Fast master key bit 11
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY12</name>
              <description>Fast master key bit 12
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY13</name>
              <description>Fast master key bit 13
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY14</name>
              <description>Fast master key bit 14
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY15</name>
              <description>Fast master key bit 15
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY16</name>
              <description>Fast master key bit 16
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY17</name>
              <description>Fast master key bit 17
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY18</name>
              <description>Fast master key bit 18
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY19</name>
              <description>Fast master key bit 19
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY20</name>
              <description>Fast master key bit 20
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY21</name>
              <description>Fast master key bit 21
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY22</name>
              <description>Fast master key bit 22
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY23</name>
              <description>Fast master key bit 23
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY24</name>
              <description>Fast master key bit 24
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY25</name>
              <description>Fast master key bit 25
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY26</name>
              <description>Fast master key bit 26
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY27</name>
              <description>Fast master key bit 27
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY28</name>
              <description>Fast master key bit 28
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY29</name>
              <description>Fast master key bit 29
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY30</name>
              <description>Fast master key bit 30
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
            <field>
              <name>FMKEY31</name>
              <description>Fast master key bit 31
This key is used by the MCE block cipher in fast mode, if CTXID=0x0 in MCE_REGCR register.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
