knieriem/tinygo-stm32-svd/svd/stm32h7s.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PWR</name>
      <description>Power control</description>
      <groupName>PWR</groupName>
      <baseAddress>0x58024800</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x54</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>CR1</name>
          <displayName>CR1</displayName>
          <description>PWR control register 1</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000001</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>SVOS</name>
              <description>System Stop mode voltage scaling selection.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PVDE</name>
              <description>Programmable voltage detector enable</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLS</name>
              <description>Programmable voltage detector level selection
These bits select the voltage threshold detected by the PVD.
Note: Refer to Section Electrical characteristics of the product datasheet for more details.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBP</name>
              <description>Disable backup domain write protection 
In reset state, the RCC_BDCR register, the RTC registers (including the backup registers),
BREN and MOEN bits in the PWR_CSR1 register, are protected against parasitic write access.
This bit must be set to enable write access to these registers.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FLPS</name>
              <description>Flash low-power mode in Stop mode
This bit allows to obtain the best trade-off between low-power consumption and restart time
when exiting from Stop mode.
When it is set, the Flash memory enters low-power mode when device is in Stop
mode.
consumption).</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RLPSN</name>
              <description>RAM low power mode disable in STOP.
When set the RAMs will not enter to low power mode when the system enters to STOP.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOSTE</name>
              <description>analog switch VBoost control
This bit enables the booster to guarantee the analog switch AC performance when the VDD 
supply voltage is below 2.7 V (reduction of the total harmonic distortion to have the same 
switch performance over the full supply voltage range)
The VDD supply voltage can be monitored through the PVD and the PLS bits.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVDREADY</name>
              <description>analog voltage ready
This bit is only used when the analog switch boost needs to be enabled (see BOOSTE bit).
It must be set by software when the expected VDDA analog supply level is available.
The correct analog supply level is indicated by the AVDO bit (PWR_CSR1 register) after 
setting the AVDEN bit and selecting the supply level to be monitored (ALS bits).</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AVDEN</name>
              <description>Peripheral voltage monitor on VDDA enable</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALS</name>
              <description>Analog voltage detector level selection
These bits select the voltage threshold detected by the AVD.
Note: Refer to Section Electrical characteristics of the product datasheet for more details.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SR1</name>
          <displayName>SR1</displayName>
          <description>PWR control status register 1</description>
          <addressOffset>0x4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>ACTVOS</name>
              <description>VOS currently applied for V&lt;sub&gt;CORE&lt;/sub&gt; voltage scaling selection.
These bit reflect the last VOS value applied to the PMU.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>ACTVOSRDY</name>
              <description>Voltage levels ready bit for currently used ACTVOS and SDHILEVEL
This bit is set to 1 by hardware when the voltage regulator and the SMPS step-down
converter are both disabled and Bypass mode is selected in PWR control register 2
(PWR_CSR2).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PVDO</name>
              <description>Programmable voltage detect output
This bit is set and cleared by hardware. It is valid only if the PVD has been enabled by the
PVDE bit.
PLS[2:0] bits.
bits.
Note: Since the PVD is disabled in Standby mode, this bit is equal to 0 after Standby or reset until the PVDE bit is set.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>AVDO</name>
              <description>Analog voltage detector output on VDDA
This bit is set and cleared by hardware. It is valid only if AVD on VDDA is enabled by the
AVDEN bit.
Note: Since the AVD is disabled in Standby mode, this bit is equal to 0 after Standby or reset until the AVDEN bit is set</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR1</name>
          <displayName>CSR1</displayName>
          <description>PWR control status register 1</description>
          <addressOffset>0x8</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BREN</name>
              <description>Backup regulator enable
When set, the backup regulator (used to maintain the backup RAM content in Standby and V&lt;sub&gt;BAT&lt;/sub&gt; modes) is enabled. 
If BREN is reset, the backup regulator is switched off. The backup RAM can still be used in Run and Stop modes. However, its content will be lost in Standby and V&lt;sub&gt;BAT&lt;/sub&gt; modes. 
If BREN is set, the application must wait till the backup regulator ready flag (BRRDY) is set to indicate that the data written into the SRAM will be maintained in Standby and V&lt;sub&gt;BAT&lt;/sub&gt; modes.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MONEN</name>
              <description>V&lt;sub&gt;BAT&lt;/sub&gt; and temperature monitoring enable
When set, the V&lt;sub&gt;BAT&lt;/sub&gt; supply and temperature monitoring is enabled.
Note: V&lt;sub&gt;BAT&lt;/sub&gt; and temperature monitoring are only available when the backup regulator is enabled (BREN bit set to 1).</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BRRDY</name>
              <description>Backup regulator ready
This bit is set by hardware to indicate that the backup regulator is ready.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VBATL</name>
              <description>V&lt;sub&gt;BAT&lt;/sub&gt; level monitoring versus low threshold</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>VBATH</name>
              <description>V&lt;sub&gt;BAT&lt;/sub&gt; level monitoring versus high threshold</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEMPL</name>
              <description>Temperature level monitoring versus low threshold</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>TEMPH</name>
              <description>Temperature level monitoring versus high threshold</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR2</name>
          <displayName>CSR2</displayName>
          <description>PWR control register 2</description>
          <addressOffset>0xC</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000006</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>BYPASS</name>
              <description>Power management unit bypass
Note: Illegal combinations of SDHILEVEL, SMPSEXTHP, SDEN, LDOEN and BYPASS are described in Table 41.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>LDOEN</name>
              <description>Low drop-out regulator enable
Note: Illegal combinations of SDHILEVEL, SMPSEXTHP, SDEN, LDOEN and BYPASS are described in Table 41.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>SDEN</name>
              <description>SMPS step-down converter enable
Note: Illegal combinations of SDHILEVEL, SMPSEXTHP, SDEN, LDOEN and BYPASS are described in Table 41.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>SMPSEXTHP</name>
              <description>SMPS external power delivery selection
Note: Illegal combinations of SDHILEVEL, SMPSEXTHP, SDEN, LDOEN and BYPASS are described in Table 41.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>SDHILEVEL</name>
              <description>SMPS step-down converter voltage output for LDO or external supply
 This bit is used when both the LDO and SMPS step-down converter are enabled with SDEN and LDOEN enabled or when SMPSEXTHP is enabled. In this case SDHILEVEL has to be set to 1 to confirm the regulator settings</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-writeOnce</access>
            </field>
            <field>
              <name>VBE</name>
              <description>VBAT charging enable</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VBRS</name>
              <description>VBAT charging resistor selection</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XSPICAP1</name>
              <description>XSPI port 1 capacitor control bits 
 see the product datasheet for more details</description>
              <bitOffset>10</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XSPICAP2</name>
              <description>XSPI port 2 capacitor control bits 
 see the product datasheet for more details</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XSPIM1</name>
              <description>EN_XSPIM1: this bit allow the SW to enable the XSPI interface. The XSPIM_P1 
supply must be stable prior to setting this bit.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>EN_XSPIM2</name>
              <description>EN_XSPIM2: this bit allows the SW to enable the XSPI interface, when 
available. The XSPIM_P2 supply must be stable prior to setting this bit. It should also be set 
when FMC is used.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDEXTRDY</name>
              <description>SMPS step-down converter external supply ready
 This bit is set by hardware to indicate that the external supply from the SMPS step-down converter 
 is ready.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USB33DEN</name>
              <description>VDD33_USB voltage level detector enable</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USBREGEN</name>
              <description>USB regulator enable.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>USB33RDY</name>
              <description>USB supply ready.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>USBHSREGEN</name>
              <description>USB HS regulator enable.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR3</name>
          <displayName>CSR3</displayName>
          <description>PWR CPU control register 3</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDDS</name>
              <description>Power Down Deepsleep.
This bit allows CPU to define the Deepsleep mode</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CSSF</name>
              <description>Clear Standby and Stop flags (always read as 0)
This bit is cleared to 0 by hardware.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>STOPF</name>
              <description>STOP flag 
This bit is set by hardware and cleared only by any reset or by setting the CPU CSSF bit.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>SBF</name>
              <description>System Standby flag 
This bit is set by hardware and cleared only by a POR (Power-on Reset) or by setting the 
CPU CSSF bit</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CSR4</name>
          <displayName>CSR4</displayName>
          <description>PWR control status register 4</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VOS</name>
              <description>Voltage scaling selection according to performance
These bits control the V&lt;sub&gt;CORE&lt;/sub&gt; voltage level and allow to obtains the best trade-off between
power consumption and performance:
  When increasing the performance, the voltage scaling must be changed before increasing
the system frequency.
  When decreasing performance, the system frequency must first be decreased before
changing the voltage scaling.
Note: Refer to Section Electrical characteristics of the product datasheet for more details.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>VOSRDY</name>
              <description>VOS Ready bit</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUPCR</name>
          <displayName>WKUPCR</displayName>
          <description>PWR wakeup clear register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WKUPC1</name>
              <description>Clear Wakeup pin flag for WKUP1
These bits are always read as 0.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPC2</name>
              <description>Clear Wakeup pin flag for WKUP2
These bits are always read as 0.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPC3</name>
              <description>Clear Wakeup pin flag for WKUP3
These bits are always read as 0.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPC4</name>
              <description>Clear Wakeup pin flag for WKUP4
These bits are always read as 0.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>WKUPFR</name>
          <displayName>WKUPFR</displayName>
          <description>PWR wakeup flag register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WKUPF1</name>
              <description>Wakeup pin WKUP1 flag.
This bit is set by hardware and cleared only by a Reset pin or by setting the WKUPC1 bit in the         
PWR wakeup clear register (PWR_WKUPCR).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WKUPF2</name>
              <description>Wakeup pin WKUP2 flag.
This bit is set by hardware and cleared only by a Reset pin or by setting the WKUPC2 bit in the         
PWR wakeup clear register (PWR_WKUPCR).</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WKUPF3</name>
              <description>Wakeup pin WKUP3 flag.
This bit is set by hardware and cleared only by a Reset pin or by setting the WKUPC3 bit in the         
PWR wakeup clear register (PWR_WKUPCR).</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>WKUPF4</name>
              <description>Wakeup pin WKUP4 flag.
This bit is set by hardware and cleared only by a Reset pin or by setting the WKUPC4 bit in the         
PWR wakeup clear register (PWR_WKUPCR).</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
