knieriem/tinygo-stm32-svd/svd/stm32h7s.svd
        <register>
          <name>WKUPEPR</name>
          <displayName>WKUPEPR</displayName>
          <description>PWR wakeup enable and polarity register</description>
          <addressOffset>0x28</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>WKUPEN1</name>
              <description>Enable Wakeup Pin WKUPn, (n = 4, 3, 2, 1)
Each bit is set and cleared by software.
Note: An additional wakeup event is detected if WKUPn+1 pin is enabled (by setting the WKUPENn         
bit) when WKUPn pin level is already high when WKUPPn+1 selects rising edge, or low when         
WKUPPn selects falling edge.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPEN2</name>
              <description>Enable Wakeup Pin WKUPn, (n = 4, 3, 2, 1)
Each bit is set and cleared by software.
Note: An additional wakeup event is detected if WKUPn+1 pin is enabled (by setting the WKUPENn         
bit) when WKUPn pin level is already high when WKUPPn+1 selects rising edge, or low when         
WKUPPn selects falling edge.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPEN3</name>
              <description>Enable Wakeup Pin WKUPn, (n = 4, 3, 2, 1)
Each bit is set and cleared by software.
Note: An additional wakeup event is detected if WKUPn+1 pin is enabled (by setting the WKUPENn         
bit) when WKUPn pin level is already high when WKUPPn+1 selects rising edge, or low when         
WKUPPn selects falling edge.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPEN4</name>
              <description>Enable Wakeup Pin WKUPn, (n = 4, 3, 2, 1)
Each bit is set and cleared by software.
Note: An additional wakeup event is detected if WKUPn+1 pin is enabled (by setting the WKUPENn         
bit) when WKUPn pin level is already high when WKUPPn+1 selects rising edge, or low when         
WKUPPn selects falling edge.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPP1</name>
              <description>Wakeup pin polarity bit for WKUPn, (n = 4, 3, 2, 1)
These bits define the polarity used for event detection on WKUPn external wakeup pin.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPP2</name>
              <description>Wakeup pin polarity bit for WKUPn, (n = 4, 3, 2, 1)
These bits define the polarity used for event detection on WKUPn external wakeup pin.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPP3</name>
              <description>Wakeup pin polarity bit for WKUPn, (n = 4, 3, 2, 1)
These bits define the polarity used for event detection on WKUPn external wakeup pin.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPP4</name>
              <description>Wakeup pin polarity bit for WKUPn, (n = 4, 3, 2, 1)
These bits define the polarity used for event detection on WKUPn external wakeup pin.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPPUPD1</name>
              <description>Wakeup pin pull configuration for WKUPn,
These bits define the I/O pad pull configuration used when WKUPENn = 1. The associated GPIO         
port pull configuration must be set to the same value or to 00.
The Wakeup pin pull configuration is kept in Standby mode.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPPUPD2</name>
              <description>Wakeup pin pull configuration for WKUPn,
These bits define the I/O pad pull configuration used when WKUPENn = 1. The associated GPIO         
port pull configuration must be set to the same value or to 00.
The Wakeup pin pull configuration is kept in Standby mode.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPPUPD3</name>
              <description>Wakeup pin pull configuration for WKUPn,
These bits define the I/O pad pull configuration used when WKUPENn = 1. The associated GPIO         
port pull configuration must be set to the same value or to 00.
The Wakeup pin pull configuration is kept in Standby mode.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>WKUPPUPD4</name>
              <description>Wakeup pin pull configuration for WKUPn,
These bits define the I/O pad pull configuration used when WKUPENn = 1. The associated GPIO         
port pull configuration must be set to the same value or to 00.
The Wakeup pin pull configuration is kept in Standby mode.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>UCPDR</name>
          <displayName>UCPDR</displayName>
          <description>PWR USB Type-C and Power Delivery register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000002</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UCPD_DBDIS</name>
              <description>UCPD dead battery disable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>UCPD_STBY</name>
              <description>UCPD Standby mode
When set, this bit is used to memorize the UCPD configuration in Standby mode. 
This bit must be written to 1 just before entering Standby mode when using UCPD.
It must be written to 0 after exiting the Standby mode and before writing any UCPD registers.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>APCR</name>
          <displayName>APCR</displayName>
          <description>PWR apply pull configuration register</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x00030000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>APC</name>
              <description>Apply pull-up and pull-down configuration
When this bit is set, the I/O pull-up and pull-down configurations defined in PO5_PUPD, PN7_PUPD bits and PUCRx, PDCRx registers are applied in Standby mode even after wakeup until APC bit is reset to 0.
When this bit is cleared,  the I/O pull-up or pull-down configurations defined in PO5_PUPD, PN7_PUPD bits and PUCRx and PDCRx registers are not applied in Standby mode and IO becomes Hi-Z.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PN7_PUPD</name>
              <description>Port N bit 7 pull-up/down configuration
When this bit is set, a weak pull-up or pull-down resistor is applied on PN7 following inverse logic applied on PN6.
If the PUN6 bit in PWR_PUCRN register is set and APC bit is set the week pull-down is applied on PN7.
If the PDN6 bit in PWR_PDCRN register is set and APC bit is set the week pull-up is applied on PN7.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PO5_PUPD</name>
              <description>Port O bit 5 pull-up/down configuration
When this bit is set, a weak pull-up or pull down resistor is applied on PO5 following inverse logic applied on PO4.
If the PUO4 bit in PWR_PUCRO register is set and APC bit is set the week pull-down is applied on PO5.
If the PDO4 bit in PWR_PDCRO register is set and APC bit is set the week pull-up is applied on PO5..</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I3CPB6_PU</name>
              <description>Port PB6 I3C pull-up bit 
When I3C is used on PB6, when set, this bit activates the pull-up on I3C1_SCL (PB6) in standby mode.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I3CPB7_PU</name>
              <description>Port PB7 I3C pull-up bit 
When I3C is used on PB7, when set, this bit activates the pull-up on I3C1_SDA (PB7) in standby mode.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I3CPB8_PU</name>
              <description>Port PB8 I3C pull-up bit 
When I3C is used on PB8, when set, this bit activates the pull-up on I3C1_SCL (PB8) in standby mode.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>I3CPB9_PU</name>
              <description>Port PB9 I3C pull-up bit 
When I3C is used on PB9, when set, this bit activates the pull-up on I3C1_SDA (PB9) in standby mode.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRN</name>
          <displayName>PUCRN</displayName>
          <description>PWR port N pull-up control register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PUN1</name>
              <description>Port N pull-up bit 1
When set, each bit activates the pull-up on PN1 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD1 bit is also set.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUN6</name>
              <description>Port N pull-up bit 6 
When set activates the pull-up on PN6 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PDN6 bit is also set.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUN12</name>
              <description>Port N pull-up bit 12 
When set, each bit activates the pull-up on PN12 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding PD12 bit is also set.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRN</name>
          <displayName>PDCRN</displayName>
          <description>PWR port N pull-down control register</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDN0</name>
              <description>Port N pull-down bit 0
When set activates the pull-down on PN0 when the APC bit is set in PWR_APCR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDN1</name>
              <description>Port N pull-down bit 1
When set activates the pull-down on PN1 when the APC bit is set in PWR_APCR.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDN2N5</name>
              <description>Port N PN2 to PN5 pull-down activation
When set, four pull-down resistors are activated on PN2 to PN5 when the APC bit is set in PWR_APCR.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDN6</name>
              <description>Port N pull-down bit 6
When set activates the pull-down on PN6 when the APC bit is set in PWR_APCR.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDN8N11</name>
              <description>Port N - PN8 to PN11 pull-down activation
When set, four pull-down resistors are activated on PN8 to PN11 when the APC bit is set in PWR_APCR.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDN12</name>
              <description>Port N pull-down bit 12
When set activates the pull-down on PN12 when the APC bit is set in PWR_APCR.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PUCRO</name>
          <displayName>PUCRO</displayName>
          <description>PWR port O pull-up control register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PUO0</name>
              <description>(n = 1 to 0) Port O pull-up bits 
When set, each bit activates the pull-up on POy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding bits in PWR_PDCRO is also set.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUO1</name>
              <description>(n = 1 to 0) Port O pull-up bits 
When set, each bit activates the pull-up on POy when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding bits in PWR_PDCRO is also set.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PUO4</name>
              <description>Port O pull-up bit 4
When set activates the pull-up on PO4 when the APC bit is set in PWR_APCR. The pull-up is not activated if the corresponding bits PDO4 in PWR_PDCRO is also set.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRO</name>
          <displayName>PDCRO</displayName>
          <description>PWR port O pull-down control register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDO0</name>
              <description>Port O pull-down bit y 
When set, each bit activates the pull-down on POy when the APC bit is set in PWR_APCR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDO1</name>
              <description>Port O pull-down bit y 
When set, each bit activates the pull-down on POy when the APC bit is set in PWR_APCR.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDO2</name>
              <description>Port O pull-down bit y 
When set, each bit activates the pull-down on POy when the APC bit is set in PWR_APCR.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDO3</name>
              <description>Port O pull-down bit y 
When set, each bit activates the pull-down on POy when the APC bit is set in PWR_APCR.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDO4</name>
              <description>Port O pull-down bit y 
When set, each bit activates the pull-down on POy when the APC bit is set in PWR_APCR.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDCRP</name>
          <displayName>PDCRP</displayName>
          <description>PWR port P pull-down control register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDP0P3</name>
              <description>Port P0-P3 pull-down activation
When set, four pull-down resistors are activated on P0 to P3 when the APC bit is set in PWR_APCR.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDP4P7</name>
              <description>Port P4-P7 pull-down activation
When set, four pull-down resitors are activated on P4 to P7 when the APC bit is set in PWR_APCR.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDP8P11</name>
              <description>Port P8-P11 pull-down activation
When set, four pull-down resistors are activated on P8 to P11 when the APC bit is set in PWR_APCR.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PDP12P15</name>
              <description>Port P12-P15 pull-down activation
 When set, four pull-down resistors are activated on P8 to P11 when the APC bit is set in PWR_APCR.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDR1</name>
          <displayName>PDR1</displayName>
          <description>PWR debug register 1</description>
          <addressOffset>0x50</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>UNLOCKED</name>
              <description>Debug Register Unlocked.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SDFPWMEN</name>
              <description>Step down converter force PWM mode</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SYNC_ADC</name>
              <description>(Non-User bit)</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
