knieriem/tinygo-stm32-svd/svd/stm32h7s.svd
        <register>
          <name>PLLCFGR</name>
          <displayName>PLLCFGR</displayName>
          <description>RCC PLLs configuration register</description>
          <addressOffset>0x2C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PLL1FRACEN</name>
              <description>PLL1 fractional latch enable
Set and reset by software to latch the content of FRACN into the sigma-delta modulator.
In order to latch the FRACN value into the sigma-delta modulator, PLL1FRACLE must be set to 0, then set to 1. The transition 0 to 1 transfers the content of FRACN into the modulator.
Refer to PLL initialization procedure on page 444 for additional information.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PLL1FRACEN</name>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset latch to tranfer FRACN to the Sigma-Delta modulator</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Set</name>
                  <description>Set latch to tranfer FRACN to the Sigma-Delta modulator</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL1VCOSEL</name>
              <description>PLL1 VCO selection
Set and reset by software to select the proper VCO frequency range used for PLL1.
This bit must be written before enabling the PLL1. It allows the application to select the VCO range:
VCOH: working from 400 to 1600 MHz (F&lt;sub&gt;ref1_ck&lt;/sub&gt; must be between 2 and 16 MHz)
VCOL: working from 150 to 420 MHz (F&lt;sub&gt;ref1_ck&lt;/sub&gt; must be between 1 and 2 MHz)</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PLL1VCOSEL</name>
                <enumeratedValue>
                  <name>WideVCO</name>
                  <description>VCO frequency range 192 to 836 MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MediumVCO</name>
                  <description>VCO frequency range 150 to 420 MHz</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PLL1SSCGEN</name>
              <description>PLL1 SSCG enable
Set and reset by software to enable the Spread Spectrum Clock Generator of PLL1, in order to
reduce the amount of EMI peaks.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL1RGE</name>
              <description>PLL1 input frequency range
Set and reset by software to select the proper reference frequency range used for PLL1.
This bit must be written before enabling the PLL1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PLL1RGE</name>
                <enumeratedValue>
                  <name>Range1</name>
                  <description>Frequency is between 1 and 2 MHz</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Range2</name>
                  <description>Frequency is between 2 and 4 MHz</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Range4</name>
                  <description>Frequency is between 4 and 8 MHz</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Range8</name>
                  <description>Frequency is between 8 and 16 MHz</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVP1EN</name>
              <description>PLL1 DIVP divider output enable
Set and reset by software to enable the pll1_p_ck output of the PLL1.
The hardware prevents writing this bit to 0, if the PLL1 output is used as the system clock (SW=3).
In order to save power, when the pll1_p_ck output of the PLL1 is not used, the pll1_p_ck must be disabled.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>DIVP1EN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>Clock ouput is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>Clock output is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DIVQ1EN</name>
              <description>PLL1 DIVQ divider output enable
Set and reset by software to enable the pll1_q_ck output of the PLL1.
The hardware prevents writing this bit if FMCCKP = 1.
In order to save power, when the pll1_q_ck output of the PLL1 is not used, the pll1_q_ck must be disabled.</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVR1EN</name>
              <description>PLL1 DIVR divider output enable
Set and reset by software to enable the pll1_r_ck output of the PLL1.
To save power, PLL1DIVREN and DIVR1 bits must be set to 0 when the pll1_r_ck is not used.</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVS1EN</name>
              <description>PLL1 DIVS divider output enable
Set and reset by software to enable the pll1_s_ck output of the PLL1.
To save power, PLL1DIVSEN must be set to 0 when the pll1_s_ck is not used.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVT1EN</name>
              <description>PLL1 DIVT divider output enable
Set and reset by software to enable the pll1_t_ck output of the PLL1.
To save power, PLL1DIVTEN must be set to 0 when the pll1_t_ck is not used.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>PLL2FRACEN</name>
              <description>PLL2 fractional latch enable
Set and reset by software to latch the content of FRACN into the sigma-delta modulator.
In order to latch the FRACN value into the sigma-delta modulator, PLL2FRACLE must be set to 0, then set to 1. The transition 0 to 1 transfers the content of FRACN into the modulator. 
Refer to PLL initialization procedure on page 444 for additional information.</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="PLL1FRACEN"/>
            </field>
            <field>
              <name>PLL2VCOSEL</name>
              <description>PLL2 VCO selection
Set and reset by software to select the proper VCO frequency range used for PLL2.
This bit must be written before enabling the PLL2. It allows the application to select the VCO range:
VCOH: working from 400 to 1600 MHz (F&lt;sub&gt;ref2_ck&lt;/sub&gt; must be between 2 and 16 MHz)
VCOL: working from 150 to 420 MHz (F&lt;sub&gt;ref2_ck&lt;/sub&gt; must be between 1 and 2 MHz)</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="PLL1VCOSEL"/>
            </field>
            <field>
              <name>PLL2SSCGEN</name>
              <description>PLL2 SSCG enable
Set and reset by software to enable the Spread Spectrum Clock Generator of PLL2, in order to
reduce the amount of EMI peaks.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL2RGE</name>
              <description>PLL2 input frequency range
Set and reset by software to select the proper reference frequency range used for PLL2.
These bits must be written before enabling the PLL2.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="PLL1RGE"/>
            </field>
            <field>
              <name>DIVP2EN</name>
              <description>PLL2 DIVP divider output enable
Set and reset by software to enable the pll2_p_ck output of the PLL2.
To save power, PLL2DIVPEN and DIVP bits must be set to 0 when the pll2_p_ck is not used.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVQ2EN</name>
              <description>PLL2 DIVQ divider output enable
Set and reset by software to enable the pll2_q_ck output of the PLL2.
To save power, PLL3DIVQEN and DIVQ bits must be set to 0 when the pll2_q_ck is not used.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVR2EN</name>
              <description>PLL2 DIVR divider output enable
Set and reset by software to enable the pll2_r_ck output of the PLL2.
The hardware prevents writing this bit if FMCCKP = 1.
To save power, PLL3DIVREN and DIVR3 bits must be set to 0 when the pll3_r_ck is not used.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVS2EN</name>
              <description>PLL2 DIVS divider output enable
Set and reset by software to enable the pll2_s_ck output of the PLL2.
To save power, PLL2DIVSEN must be set to 0 when the pll2_s_ck is not used.
The hardware prevents writing this bit if XSPICKP = 1.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVT2EN</name>
              <description>PLL2 DIVT divider output enable
Set and reset by software to enable the pll2_t_ck output of the PLL2.
To save power, PLL2DIVTEN must be set to 0 when the pll2_t_ck is not used.
The hardware prevents writing this bit if XSPICKP = 1.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>PLL3FRACEN</name>
              <description>PLL3 fractional latch enable
Set and reset by software to latch the content of FRACN into the sigma-delta modulator.
In order to latch the FRACN value into the sigma-delta modulator, PLL3FRACLE must be set to 0, then set to 1. The transition 0 to 1 transfers the content of FRACN into the modulator. 
Refer to PLL initialization procedure on page 444 for additional information.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="PLL1FRACEN"/>
            </field>
            <field>
              <name>PLL3VCOSEL</name>
              <description>PLL3 VCO selection
Set and reset by software to select the proper VCO frequency range used for PLL3.
This bit must be written before enabling the PLL3. It allows the application to select the VCO range:
VCOH: working from 400 to 1600 MHz (F&lt;sub&gt;ref2_ck&lt;/sub&gt; must be between 2 and 16 MHz)
VCOL: working from 150 to 420 MHz (F&lt;sub&gt;ref2_ck&lt;/sub&gt; must be between 1 and 2 MHz)</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="PLL1VCOSEL"/>
            </field>
            <field>
              <name>PLL3SSCGEN</name>
              <description>PLL3 SSCG enable
Set and reset by software to enable the Spread Spectrum Clock Generator of PLL3, in order to
reduce the amount of EMI peaks.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>PLL3RGE</name>
              <description>PLL3 input frequency range
Set and reset by software to select the proper reference frequency range used for PLL3.
These bits must be written before enabling the PLL3.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="PLL1RGE"/>
            </field>
            <field>
              <name>DIVP3EN</name>
              <description>PLL3 DIVP divider output enable
Set and reset by software to enable the pll3_p_ck output of the PLL3.
To save power, PLL3DIVREN and DIVR3 bits must be set to 0 when the pll3_r_ck is not used.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVQ3EN</name>
              <description>PLL3 DIVQ divider output enable
Set and reset by software to enable the pll3_q_ck output of the PLL3.
To save power, PLL3DIVREN and DIVR3 bits must be set to 0 when the pll3_r_ck is not used.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVR3EN</name>
              <description>PLL3 DIVR divider output enable
Set and reset by software to enable the pll3_r_ck output of the PLL3.
To save power, PLL3DIVREN and DIVR3 bits must be set to 0 when the pll3_r_ck is not used.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVS3EN</name>
              <description>PLL3 DIVS divider output enable
Set and reset by software to enable the pll3_s_ck output of the PLL3.
To save power, PLL3DIVSEN must be set to 0 when the pll3_s_ck is not used.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
            <field>
              <name>DIVT3EN</name>
              <description>PLL3 DIVT divider output enable
Set and reset by software to enable the pll3_t_ck output of the PLL3.
To save power, PLL1DIVTEN must be set to 0 when the pll3_t_ck is not used.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="DIVP1EN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1DIVR1</name>
          <displayName>PLL1DIVR1</displayName>
          <description>RCC PLL1 dividers configuration register 1</description>
          <addressOffset>0x30</addressOffset>
          <size>0x20</size>
          <resetValue>0x01010280</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVN1</name>
              <description>multiplication factor for PLL1 VCO
Set and reset by software to control the multiplication factor of the VCO.
These bits can be written only when the PLL is disabled (PLL1ON = PLL1RDY = 0).
..........: not used
...
...
Others: wrong configurations
The software must set correctly these bits to insure that the VCO output frequency is between its valid frequency range, that is:
128 to 544MHz if PLL1VCOSEL = 0
150 to 420 MHz if PLL1VCOSEL = 1
VCO output frequency = F&lt;sub&gt;ref1_ck&lt;/sub&gt; x DIVN1, when fractional value 0 has been loaded into FRACN, with: 
DIVN1 between 8 and 420
The input frequency F&lt;sub&gt;ref1_ck&lt;/sub&gt; must be between 1 and 16 MHz.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVP</name>
              <description>PLL1 DIVP division factor
Set and reset by software to control the frequency of the pll1_p_ck clock.
These bits can be written only when the PLL1DIVPEN = 0. 
...</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVQ</name>
              <description>PLL1 DIVQ division factor
Set and reset by software to control the frequency of the pll1_q_ck clock.
These bits can be written only when the PLL1DIVQEN = 0. 
...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVR1</name>
              <description>PLL1 DIVR division factor
Set and reset by software to control the frequency of the pll1_r_ck clock.
These bits can be written only when the PLL1DIVREN = 0. 
...</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL1FRACR</name>
          <displayName>PLL1FRACR</displayName>
          <description>RCC PLL1 fractional divider register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRACN</name>
              <description>fractional part of the multiplication factor for PLL1 VCO
Set and reset by software to control the fractional part of the multiplication factor of the VCO.
These bits can be written at any time, allowing dynamic fine-tuning of the PLL1 VCO.
The software must set correctly these bits to insure that the VCO output frequency is between its valid frequency range, that is: 
128 to 544 MHz if PLL1VCOSEL = 0
150 to 420 MHz if PLL1VCOSEL = 1
VCO output frequency = F&lt;sub&gt;ref1_ck&lt;/sub&gt; x (DIVN1 + (FRACN / 2&lt;sup&gt;13&lt;/sup&gt;)), with 
DIVN1 between 8 and 420
FRACN can be between 0 and 2&lt;sup&gt;13&lt;/sup&gt;- 1
The input frequency F&lt;sub&gt;ref1_ck&lt;/sub&gt; must be between 1 and 16 MHz. 
To change the FRACN value on-the-fly even if the PLL is enabled, the application must proceed as follows:
Set the bit PLL1FRACLE to 0. 
Write the new fractional value into FRACN. 
Set the bit PLL1FRACLE to 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL2DIVR1</name>
          <displayName>PLL2DIVR1</displayName>
          <description>RCC PLL2 dividers configuration register 1</description>
          <addressOffset>0x38</addressOffset>
          <size>0x20</size>
          <resetValue>0x01010280</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVN2</name>
              <description>multiplication factor for PLL2 VCO
Set and reset by software to control the multiplication factor of the VCO.
These bits can be written only when the PLL is disabled (PLL2ON = PLL2RDY = 0).
..........: not used
...
...
Others: wrong configurations
The software must set correctly these bits to insure that the VCO output frequency is between its valid frequency range, that is:
128 to 544 MHz if PLL2VCOSEL = 0
150 to 420 MHz if PLL2VCOSEL = 1
VCO output frequency = F&lt;sub&gt;ref2_ck&lt;/sub&gt; x DIVN2, when fractional value 0 has been loaded into FRACN, with 
DIVN2 between 8 and 420
The input frequency F&lt;sub&gt;ref2_ck&lt;/sub&gt; must be between 1 and 16MHz.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVP</name>
              <description>PLL2 DIVP division factor
Set and reset by software to control the frequency of the pll2_p_ck clock.
These bits can be written only when the PLL2DIVPEN = 0. 
...</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVQ</name>
              <description>PLL2 DIVQ division factor
Set and reset by software to control the frequency of the pll2_q_ck clock.
These bits can be written only when the PLL2DIVQEN = 0. 
...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVR2</name>
              <description>PLL2 DIVR division factor
Set and reset by software to control the frequency of the pll2_r_ck clock.
These bits can be written only when the PLL2DIVREN = 0. 
...</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
