knieriem/tinygo-stm32-svd/svd/stm32h7s.svd
        <register>
          <name>PLL2FRACR</name>
          <displayName>PLL2FRACR</displayName>
          <description>RCC PLL2 fractional divider register</description>
          <addressOffset>0x3C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRACN</name>
              <description>fractional part of the multiplication factor for PLL2 VCO
Set and reset by software to control the fractional part of the multiplication factor of the VCO.
These bits can be written at any time, allowing dynamic fine-tuning of the PLL2 VCO.
The software must set correctly these bits to insure that the VCO output frequency is between its valid frequency range, that is:
128 to 544 MHz if PLL2VCOSEL = 0
150 to 420 MHz if PLL2VCOSEL = 1
VCO output frequency = F&lt;sub&gt;ref2_ck&lt;/sub&gt; x (DIVN2 + (FRACN / 2&lt;sup&gt;13&lt;/sup&gt;)), with 
DIVN2 between 8 and 420
FRACN can be between 0 and 2&lt;sup&gt;13 &lt;/sup&gt;- 1
The input frequency F&lt;sub&gt;ref2_ck&lt;/sub&gt; must be between 1 and 16 MHz.
In order to change the FRACN value on-the-fly even if the PLL is enabled, the application must proceed as follows:
Set the bit PLL2FRACLE to 0. 
Write the new fractional value into FRACN.
Set the bit PLL2FRACLE to 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3DIVR1</name>
          <displayName>PLL3DIVR1</displayName>
          <description>RCC PLL3 dividers configuration register 1</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x01010280</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DIVN3</name>
              <description>Multiplication factor for PLL3 VCO
Set and reset by software to control the multiplication factor of the VCO.
These bits can be written only when the PLL is disabled (PLL3ON = PLL3RDY = 0).
...........: not used
...
...
Others: wrong configurations
The software must set correctly these bits to insure that the VCO output frequency is between its valid frequency range, that is:
128 to 544 MHz if PLL3VCOSEL = 0
150 to 420 MHz if PLL3VCOSEL = 1
VCO output frequency = F&lt;sub&gt;ref3_ck&lt;/sub&gt; x DIVN3, when fractional value 0 has been loaded into FRACN, with: 
DIVN3 between 8 and 420
The input frequency F&lt;sub&gt;ref3_ck&lt;/sub&gt; must be between 1 and 16MHz</description>
              <bitOffset>0</bitOffset>
              <bitWidth>9</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVP</name>
              <description>PLL3 DIVP division factor
Set and reset by software to control the frequency of the pll3_p_ck clock.
These bits can be written only when the PLL3DIVPEN = 0. 
...</description>
              <bitOffset>9</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVQ</name>
              <description>PLL3 DIVQ division factor
Set and reset by software to control the frequency of the pll3_q_ck clock.
These bits can be written only when the PLL3DIVQEN = 0. 
...</description>
              <bitOffset>16</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DIVR3</name>
              <description>PLL3 DIVR division factor
Set and reset by software to control the frequency of the pll3_r_ck clock.
These bits can be written only when the PLL3DIVREN = 0. 
...</description>
              <bitOffset>24</bitOffset>
              <bitWidth>7</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PLL3FRACR</name>
          <displayName>PLL3FRACR</displayName>
          <description>RCC PLL3 fractional divider register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FRACN</name>
              <description>fractional part of the multiplication factor for PLL3 VCO
Set and reset by software to control the fractional part of the multiplication factor of the VCO.
These bits can be written at any time, allowing dynamic fine-tuning of the PLL3 VCO.
The software must set correctly these bits to insure that the VCO output frequency is between its valid frequency range, that is:
128 to 544 MHz if PLL3VCOSEL = 0
150 to 420 MHz if PLL3VCOSEL = 1
VCO output frequency = F&lt;sub&gt;ref3_ck&lt;/sub&gt; x (DIVN3 + (FRACN / 2&lt;sup&gt;13&lt;/sup&gt;)), with 
DIVN3 between 8 and 420
FRACN can be between 0 and 2&lt;sup&gt;13 &lt;/sup&gt;- 1
The input frequency F&lt;sub&gt;ref3_ck&lt;/sub&gt; must be between 1 and 16 MHz.
In order to change the FRACN value on-the-fly even if the PLL is enabled, the application must proceed as follows:
Set the bit PLL1FRACLE to 0.
Write the new fractional value into FRACN.
Set the bit PLL1FRACLE to 1.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCIPR1</name>
          <displayName>AHBPERCKSELR</displayName>
          <description>RCC AHB peripheral kernel clock selection register</description>
          <addressOffset>0x4C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000A00</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMCSEL</name>
              <description>FMC kernel clock source selection
Set and reset by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>FMCSEL</name>
                <enumeratedValue>
                  <name>RCC_HCLK5</name>
                  <description>hclk5 selected as peripheral clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL1_Q</name>
                  <description>pll1_q selected as peripheral clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_R</name>
                  <description>pll2_r selected as peripheral clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_KER</name>
                  <description>hsi_ker selected as peripheral clock</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMMCSEL</name>
              <description>SDMMC1 and SDMMC2 kernel clock source selection
Set and reset by software.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>SDMMCSEL</name>
                <enumeratedValue>
                  <name>PLL2_S</name>
                  <description>pll1_s selected as peripheral clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_T</name>
                  <description>pll2_t selected as peripheral clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCTOSPI1SEL</name>
              <description>XSPI1 kernel clock source selection
Set and reset by software.
1x: pll2_t_ck selected as kernel peripheral clock</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>OCTOSPI1SEL</name>
                <enumeratedValue>
                  <name>RCC_HCLK5</name>
                  <description>hclk5 selected as peripheral clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_S</name>
                  <description>pll2_s_ck selected as peripheral clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_T</name>
                  <description>pll2_t_ck selected as peripheral clock</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OCTOSPI2SEL</name>
              <description>XSPI2 kernel clock source selection
Set and reset by software.
1x: pll2_t_ck selected as kernel peripheral clock</description>
              <bitOffset>6</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>OCTOSPI2SEL</name>
                <enumeratedValue>
                  <name>RCC_HCLK5</name>
                  <description>hclk5 selected as peripheral clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_S</name>
                  <description>pll2_s_ck selected as peripheral clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_T</name>
                  <description>pll2_t_ck selected as peripheral clock</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBREFCKSEL</name>
              <description>USBPHYC kernel clock frequency selection
Set and reset by software.
This field is used to indicate to the USBPHYC, the frequency of the reference kernel clock provided to the USBPHYC.
others: reserved</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>USBREFCKSEL</name>
                <enumeratedValue>
                  <name>MHz16</name>
                  <description>The clock frequency provided to the USBPHYC is 16 MHz</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MHz19</name>
                  <description>The clock frequency provided to the USBPHYC is 19.2 MHz</description>
                  <value>8</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MHz20</name>
                  <description>The clock frequency provided to the USBPHYC is 20MHz</description>
                  <value>9</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MHz24</name>
                  <description>The clock frequency provided to the USBPHYC is 24 MHz</description>
                  <value>10</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MHz32</name>
                  <description>The clock frequency provided to the USBPHYC is 32 MHz</description>
                  <value>11</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MHz26</name>
                  <description>The clock frequency provided to the USBPHYC is 26 MHz</description>
                  <value>14</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>USBPHYCSEL</name>
              <description>USBPHYC kernel clock source selection
Set and reset by software.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>USBPHYCSEL</name>
                <enumeratedValue>
                  <name>HSE_KER</name>
                  <description>hse_ker_ck</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_KER_DIV2</name>
                  <description>hse_ker_ck / 2</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_Q</name>
                  <description>pll3_q_ck</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OTGFSSEL</name>
              <description>OTGFS kernel clock source selection
Set and reset by software.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>OTGFSSEL</name>
                <enumeratedValue>
                  <name>HSI48_KER</name>
                  <description>hsi48_ker_ck</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_Q</name>
                  <description>pll3_q_ck</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_KER</name>
                  <description>hse_ker_ck</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK48</name>
                  <description>clk48mohci</description>
                  <value>3</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETH1_REF_CLK_SEL</name>
              <description>Ethernet reference clock source selection
Set and reset by software.
others: reserved, the kernel clock is disabled</description>
              <bitOffset>16</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ETH1_REF_CLK_SEL</name>
                <enumeratedValue>
                  <name>ETH_RMII_REF</name>
                  <description>ETH_RMII_REF selected as peripheral clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE_KER</name>
                  <description>hse_ker selected as peripheral clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ETH_CLK_FB</name>
                  <description>eth_clk_fb selected as peripheral clock</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ETHPHY_CLK_SEL</name>
              <description>Clock source selection for external Ethernet PHY
Set and reset by software.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ETHPHY_CLK_SEL</name>
                <enumeratedValue>
                  <name>HSE_KER</name>
                  <description>hse_ker selected as clock source</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_S</name>
                  <description>pll3_s selected clock source</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADFSEL</name>
              <description>ADF kernel clock source selection
Set and reset by software.
Note: I2S_CKIN is an external clock taken from a pin.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ADFSEL</name>
                <enumeratedValue>
                  <name>HCLK1</name>
                  <description>hclk1 selected as ADF clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL2_p</name>
                  <description>pll2_p_ck selected as ADF clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_P</name>
                  <description>pll3_p_ck selected as ADF clock</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>I2S_CLKIN</name>
                  <description>I2S_CKIN selected as ADF clock</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI_KER</name>
                  <description>csi_ker_ck selected as ADF clock</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSI_KER</name>
                  <description>hsi_ker_ck selected as ADF clock</description>
                  <value>5</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADCSEL</name>
              <description>SAR ADC kernel clock source selection
Set and reset by software.
others: reserved, the kernel clock is disabled</description>
              <bitOffset>24</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>ADCSEL</name>
                <enumeratedValue>
                  <name>PLL2_P</name>
                  <description>pll2_p selected as peripheral clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PLL3_R</name>
                  <description>pll3_r selected as peripheral clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER</name>
                  <description>per selected as peripheral clock</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PSSISEL</name>
              <description>PSSI kernel clock source selection
Set and reset by software.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PSSISEL</name>
                <enumeratedValue>
                  <name>PLL3_R</name>
                  <description>pll3_r selected as peripheral clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PER</name>
                  <description>per selected as kernel peripheral clock</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CKPERSEL</name>
              <description>per_ck clock source selection</description>
              <bitOffset>28</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>CKPERSEL</name>
                <enumeratedValue>
                  <name>HSI</name>
                  <description>HSI selected as peripheral clock</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CSI</name>
                  <description>CSI selected as peripheral clock</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>HSE</name>
                  <description>HSE selected as peripheral clock</description>
                  <value>2</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
        </register>
