knieriem/tinygo-stm32-svd/svd/stm32h7s.svd
        <register>
          <name>PLL3SSCGR</name>
          <displayName>PLL3SSCGR</displayName>
          <description>RCC PLL3 Spread Spectrum Clock Generator register</description>
          <addressOffset>0xD4</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MOD_PER</name>
              <description>Modulation Period Adjustment for PLL3
Set and reset by software to adjust the modulation period of the clock spreading generator.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>13</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>TPDFN_DIS3</name>
              <description>Dithering TPDF noise control for PLL3
Set and reset by software.
This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a triangular probability density function.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>RPDFN_DIS3</name>
              <description>Dithering RPDF noise control for PLL3
Set and reset by software.
This bit is used to enable or disable the injection of a dithering noise into the SSCG modulator. This dithering noise is generated using a rectangular probability density function.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DWNSPREAD3</name>
              <description>Spread spectrum clock generator mode for PLL3
Set and reset by software to select the clock spreading mode.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>INC_STEP</name>
              <description>Modulation Depth Adjustment for PLL3
Set and reset by software to adjust the modulation depth of the clock spreading generator.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CKPROTR</name>
          <displayName>CKPROTR</displayName>
          <description>RCC clock protection register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>XSPICKP</name>
              <description>XSPI clock protection
Set and cleared by software.
When set to 1, this bit prevents disabling accidentally the XSPIs. The following fields cannot be modified when this bit is set to 1:
PLL2ON, PLL2DIVSEN, PLL2DIVTEN, HSEON, HSION, CSION, XSPIxEN, OCTOSPIxLPEN, OCTOSPIxRST.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMCCKP</name>
              <description>FMC clock protection
Set and cleared by software.
When set to 1, this bit prevents disabling accidentally the FMC. The following fields cannot be modified when this bit is set to 1:
PLL1ON, PLL2ON, PLL1DIVQEN, PLL2DIVREN, HSEON, HSION, CSION, FMCEN, FMCLPEN, FMCRST.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>XSPI1SWP</name>
              <description>XSPI1 kernel clock switch position
Set by hardware.
This field can be used to verify the real position of XSPI2 kernel switch selector.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>XSPI2SWP</name>
              <description>XSPI2 kernel clock switch position
Set by hardware.
This field can be used to verify the real position of XSPI2 kernel switch selector.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FMCSWP</name>
              <description>FMC kernel clock switch position
Set by hardware.
This field can be used to verify the real position of FMC kernel switch selector.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSR</name>
          <displayName>RSR</displayName>
          <description>RCC Reset status register</description>
          <addressOffset>0x130</addressOffset>
          <size>0x20</size>
          <resetValue>0x00E00000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RMVF</name>
              <description>remove reset flag
Set and reset by software to reset the value of the reset flags.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>RMVF</name>
                <enumeratedValue>
                  <name>NotActivated</name>
                  <description>Reset not activated</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Reset</name>
                  <description>Reset the reset status flags</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>OBLRSTF</name>
              <description>Option byte loading reset flag &lt;sup&gt;(1)&lt;/sup&gt;
Reset by software by the RMVF bit. 
Set by hardware when a reset from the option byte loading occurs.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <name>OBLRSTFR</name>
                <enumeratedValue>
                  <name>NoResetOccurred</name>
                  <description>No reset occurred for block</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ResetOccurred</name>
                  <description>Reset occurred for block</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BORRSTF</name>
              <description>BOR reset flag &lt;sup&gt;(1)&lt;/sup&gt;
Reset by software by writing the RMVF bit.
Set by hardware when a BOR reset occurs (pwr_bor_rst).</description>
              <bitOffset>21</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>PINRSTF</name>
              <description>pin reset flag (NRST) &lt;sup&gt;(1)&lt;/sup&gt;
Reset by software by writing the RMVF bit.
Set by hardware when a reset from pin occurs.</description>
              <bitOffset>22</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>PORRSTF</name>
              <description>POR/PDR reset flag &lt;sup&gt;(1)&lt;/sup&gt;
Reset by software by writing the RMVF bit.
Set by hardware when a POR/PDR reset occurs.</description>
              <bitOffset>23</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>SFTRSTF</name>
              <description>system reset from CPU reset flag &lt;sup&gt;(1)&lt;/sup&gt;
Reset by software by writing the RMVF bit.
Set by hardware when the system reset is due to CPU.The CPU can generate a system reset by writing SYSRESETREQ bit of AIRCR register of the core M7.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>IWDGRSTF</name>
              <description>independent watchdog reset flag &lt;sup&gt;(1)&lt;/sup&gt;
Reset by software by writing the RMVF bit.
Set by hardware when an independent watchdog reset occurs.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>WWDGRSTF</name>
              <description>window watchdog reset flag &lt;sup&gt;(1)&lt;/sup&gt;
Reset by software by writing the RMVF bit.
Set by hardware when a window watchdog reset occurs.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
            <field>
              <name>LPWRRSTF</name>
              <description>reset due to illegal Stop or Standby flag 
Reset by software by writing the RMVF bit.
Set by hardware when the CPU goes erroneously in Stop or Standby mode,</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues derivedFrom="OBLRSTFR"/>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB5ENR</name>
          <displayName>AHB5ENR</displayName>
          <description>RCC AHB5 clock enable register</description>
          <addressOffset>0x134</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>HPDMA1EN</name>
              <description>HPDMA1 peripheral clock enable
Set and reset by software.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>HPDMA1EN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The selected clock is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The selected clock is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DMA2DEN</name>
              <description>DMA2D peripheral clock enable
Set and reset by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HPDMA1EN"/>
            </field>
            <field>
              <name>JPEGEN</name>
              <description>JPEG peripheral clock enable
Set and reset by software.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HPDMA1EN"/>
            </field>
            <field>
              <name>FMCEN</name>
              <description>FMC and MCE3 peripheral clocks enable
Set and reset by software.
The hardware prevents writing this bit if FMCCKP = 1.
The peripheral clocks of the FMC are the kernel clock selected by FMCSEL, and the hclk5 bus interface clock.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HPDMA1EN"/>
            </field>
            <field>
              <name>XSPI1EN</name>
              <description>XSPI1 and MCE1 peripheral clocks enable
Set and reset by software.
The hardware prevents writing this bit if XSPICKP = 1.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HPDMA1EN"/>
            </field>
            <field>
              <name>SDMMC1EN</name>
              <description>SDMMC1 and DB_SDMMC1 peripheral clocks enable
Set and reset by software.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HPDMA1EN"/>
            </field>
            <field>
              <name>XSPI2EN</name>
              <description>XSPI2 and MCE2 peripheral clocks enable
Set and reset by software.
The hardware prevents writing this bit if XSPICKP = 1.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HPDMA1EN"/>
            </field>
            <field>
              <name>XSPIMEN</name>
              <description>XSPIM peripheral clock enable
Set and reset by software.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HPDMA1EN"/>
            </field>
            <field>
              <name>GFXMMUEN</name>
              <description>GFXMMU peripheral clock enable
Set and reset by software.</description>
              <bitOffset>19</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HPDMA1EN"/>
            </field>
            <field>
              <name>GPUEN</name>
              <description>GPU peripheral clock enable
Set and reset by software.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="HPDMA1EN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB1ENR</name>
          <displayName>AHB1ENR</displayName>
          <description>RCC AHB1 clock enable register</description>
          <addressOffset>0x138</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>GPDMA1EN</name>
              <description>GPDMA1 clock enable
Set and reset by software.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>GPDMA1EN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The selected clock is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The selected clock is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>ADC12EN</name>
              <description>ADC1 and 2 peripheral clocks enable
Set and reset by software.
The peripheral clocks of the ADC1 and 2 are the kernel clock selected by ADCSEL and provided to ADCx_CK input, and the hclk1 bus interface clock.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1EN"/>
            </field>
            <field>
              <name>ETH1MACEN</name>
              <description>ETH1 MAC peripheral clock enable
Set and reset by software.</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1EN"/>
            </field>
            <field>
              <name>ETH1TXEN</name>
              <description>ETH1 transmission clock enable
Set and reset by software.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1EN"/>
            </field>
            <field>
              <name>ETH1RXEN</name>
              <description>ETH1 reception clock enable
Set and reset by software.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1EN"/>
            </field>
            <field>
              <name>OTGHSEN</name>
              <description>OTGHS clocks enable
Set and reset by software.</description>
              <bitOffset>25</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1EN"/>
            </field>
            <field>
              <name>USBPHYCEN</name>
              <description>USBPHYC clocks enable
Set and reset by software.</description>
              <bitOffset>26</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1EN"/>
            </field>
            <field>
              <name>OTGFSEN</name>
              <description>OTGFS peripheral clocks enable
Set and reset by software.</description>
              <bitOffset>27</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1EN"/>
            </field>
            <field>
              <name>ADFEN</name>
              <description>ADF clocks enable
Set and reset by software.</description>
              <bitOffset>31</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="GPDMA1EN"/>
            </field>
          </fields>
        </register>
        <register>
          <name>AHB2ENR</name>
          <displayName>AHB2ENR</displayName>
          <description>RCC AHB2 clock enable register</description>
          <addressOffset>0x13C</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PSSIEN</name>
              <description>PSSI peripheral clocks enable
Set and reset by software.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <name>PSSIEN</name>
                <enumeratedValue>
                  <name>Disabled</name>
                  <description>The selected clock is disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>Enabled</name>
                  <description>The selected clock is enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SDMMC2EN</name>
              <description>SDMMC2 and SDMMC2 delay clock enable
Set and reset by software.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="PSSIEN"/>
            </field>
            <field>
              <name>CORDICEN</name>
              <description>CORDIC clock enable
Set and reset by software.</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="PSSIEN"/>
            </field>
            <field>
              <name>SRAM1EN</name>
              <description>SRAM1 clock enable
Set and reset by software.</description>
              <bitOffset>29</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="PSSIEN"/>
            </field>
            <field>
              <name>SRAM2EN</name>
              <description>SRAM2 clock enable
Set and reset by software.</description>
              <bitOffset>30</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues derivedFrom="PSSIEN"/>
            </field>
          </fields>
        </register>
