knieriem/tinygo-stm32-svd/svd/stm32h7s.svd
        <register>
          <name>BDR</name>
          <displayName>BDR</displayName>
          <description>SAI data register</description>
          <addressOffset>0x40</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DATA</name>
              <description>Data 
A write to this register loads the FIFO provided the FIFO is not full.
A read from this register empties the FIFO if the FIFO is not empty.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDMCR</name>
          <displayName>PDMCR</displayName>
          <description>SAI PDM control register</description>
          <addressOffset>0x44</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>PDMEN</name>
              <description>PDM enable 
This bit is set and cleared by software. This bit enables to control the state of the PDM interface block.
Make sure that the SAI in already operating in TDM master mode before enabling the PDM interface.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>MICNBR</name>
              <description>Number of microphones
This bit is set and cleared by software. 
Note: It is not recommended to configure this field when PDMEN = 1.*
Note: The complete set of data lines might not be available for all SAI instances. Refer to Section 55.3: SAI implementation for details.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>2</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEN1</name>
              <description>Clock enable of bitstream clock number 1
This bit is set and cleared by software. 
Note: It is not recommended to configure this bit when PDMEN = 1.
Note: SAI_CK1 might not be available for all SAI instances. Refer to Section 55.3: SAI implementation for details.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CKEN2</name>
              <description>Clock enable of bitstream clock number 2
This bit is set and cleared by software. 
Note: It is not recommended to configure this bit when PDMEN = 1.
Note: SAI_CK2 might not be available for all SAI instances. Refer to Section 55.3: SAI implementation for details.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PDMDLY</name>
          <displayName>PDMDLY</displayName>
          <description>SAI PDM delay register</description>
          <addressOffset>0x48</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DLYM1L</name>
              <description>Delay line adjust for first microphone of pair 1
This bit is set and cleared by software. 
...
This field can be changed on-the-fly.
Note: This field can be used only if D1 line is available.Refer to Section 55.3: SAI implementation to check if it is available.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLYM1R</name>
              <description>Delay line adjust for second microphone of pair 1
This bit is set and cleared by software. 
...
This field can be changed on-the-fly.
Note: This field can be used only if D1 line is available.Refer to Section 55.3: SAI implementation to check if it is available.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLYM2L</name>
              <description>Delay line for first microphone of pair 2
This bit is set and cleared by software. 
...
This field can be changed on-the-fly.
Note: This field can be used only if D2 line is available.Refer to Section 55.3: SAI implementation to check if it is available.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLYM2R</name>
              <description>Delay line for second microphone of pair 2
This bit is set and cleared by software. 
...
This field can be changed on-the-fly.
Note: This field can be used only if D2 line is available.Refer to Section 55.3: SAI implementation to check if it is available.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLYM3L</name>
              <description>Delay line for first microphone of pair 3
This bit is set and cleared by software. 
... 
This field can be changed on-the-fly.
Note: This field can be used only if D3 line is available.Refer to Section 55.3: SAI implementation to check if it is available.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLYM3R</name>
              <description>Delay line for second microphone of pair 3
This bit is set and cleared by software. 
...
This field can be changed on-the-fly.
Note: This field can be used only if D3 line is available.Refer to Section 55.3: SAI implementation to check if it is available.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLYM4L</name>
              <description>Delay line for first microphone of pair 4
This bit is set and cleared by software. 
...
This field can be changed on-the-fly.
Note: This field can be used only if D4 line is available.Refer to Section 55.3: SAI implementation to check if it is available.</description>
              <bitOffset>24</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DLYM4R</name>
              <description>Delay line for second microphone of pair 4
This bit is set and cleared by software. 
...
This field can be changed on-the-fly.
Note: This field can be used only if D4 line is available.Refer to Section 55.3: SAI implementation to check if it is available.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
