knieriem/tinygo-stm32-svd/svd/stm32h7s.svd
      </registers>
    </peripheral>
    <peripheral derivedFrom="SAI1">
      <name>SAI2</name>
      <baseAddress>0x42005800</baseAddress>
      <interrupt>
        <name>SAI2_A</name>
        <description>SAI2 global interrupt A</description>
        <value>74</value>
      </interrupt>
      <interrupt>
        <name>SAI2_B</name>
        <description>SAI2 global interrupt B</description>
        <value>75</value>
      </interrupt>
    </peripheral>
    <peripheral>
      <name>SBS</name>
      <description>System configuration, boot and security</description>
      <groupName>SBS</groupName>
      <baseAddress>0x58000400</baseAddress>
      <addressBlock>
        <offset>0x0</offset>
        <size>0x140</size>
        <usage>registers</usage>
      </addressBlock>
      <registers>
        <register>
          <name>BOOTSR</name>
          <displayName>BOOTSR</displayName>
          <description>SBS boot status register</description>
          <addressOffset>0x0</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INITVTOR</name>
              <description>initial vector for Cortex-M7
This register includes the physical boot address used by the Cortex-M7 after reset</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HDPLCR</name>
          <displayName>HDPLCR</displayName>
          <description>SBS hide protection control register</description>
          <addressOffset>0x10</addressOffset>
          <size>0x20</size>
          <resetValue>0x000000B4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>INCR_HDPL</name>
              <description>increment HDPL
Write 0x6A to increment device HDPL by one.
After a write, the register value reverts to its default value (0xB4).</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>HDPLSR</name>
          <displayName>HDPLSR</displayName>
          <description>SBS hide protection status register</description>
          <addressOffset>0x14</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFF00</resetMask>
          <fields>
            <field>
              <name>HDPL</name>
              <description>hide protection level
This bitfield returns the current HDPL of the device.
0x6F and other codes: HDPL3, corresponding to non-boot application.
Note: The device state (open/close) is defined in FLASH_NVSTATER register of the embedded Flash memory.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGCR</name>
          <displayName>DBGCR</displayName>
          <description>SBS debug control register</description>
          <addressOffset>0x20</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>AP_UNLOCK</name>
              <description>access port unlock
Write 0xB4 to this bitfield to open the device access port.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_UNLOCK</name>
              <description>debug unlock
Write 0xB4 to this bitfield to open the debug when HDPL in SBS_HDPLSR equals to DBG_AUTH_HDPL in this register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>DBG_AUTH_HDPL</name>
              <description>authenticated debug hide protection level
Writing to this bitfield defines at which HDPL the authenticated debug opens.
Note: Writing any other values is ignored. Reading any other value means the authenticated debug always fails.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>DBGLOCKR</name>
          <displayName>DBGLOCKR</displayName>
          <description>SBS debug lock register</description>
          <addressOffset>0x24</addressOffset>
          <size>0x20</size>
          <resetValue>0x000000B4</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>DBGCFG_LOCK</name>
              <description>debug configuration lock
Reading this bitfield returns 0x6A if the bitfield value is different from 0xB4.
Other: Writes to SBS_DBGCR ignored
Note: 0xC3 is the recommended value to lock the debug configuration using this bitfield.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RSSCMDR</name>
          <displayName>RSSCMDR</displayName>
          <description>SBS RSS command register</description>
          <addressOffset>0x34</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>RSSCMD</name>
              <description>RSS command
The application can use this bitfield to pass on a command to the RSS, executed at the next reset.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>PMCR</name>
          <displayName>PMCR</displayName>
          <description>SBS product mode and configuration register</description>
          <addressOffset>0x100</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FMPLUS_PB6</name>
              <description>Fast-mode Plus on PB(6)</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMPLUS_PB7</name>
              <description>Fast-mode Plus on PB(7)</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMPLUS_PB8</name>
              <description>Fast-mode Plus on PB(8)</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FMPLUS_PB9</name>
              <description>Fast-mode Plus on PB(9)</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOSTEN</name>
              <description>booster enable
Set this bit to reduce the THD of the analog switches when the supply voltage is below 2.7 V. guaranteeing the same performance as with the full voltage range. To avoid current consumption due to booster activation when V&lt;sub&gt;DDA&lt;/sub&gt; &lt; 2.7 V and V&lt;sub&gt;DD&lt;/sub&gt; &gt; 2.7 V, V&lt;sub&gt;DD&lt;/sub&gt; can be selected as supply voltage for analog switches by setting BOOSTVDDSEL bit in SBS_PMCR. In this case, the BOOSTEN bit must be cleared to avoid unwanted power consumption.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>BOOSTVDDSEL</name>
              <description>booster V&lt;sub&gt;DD&lt;/sub&gt; selection
This bit selects the analog switch supply voltage, between V&lt;sub&gt;DD&lt;/sub&gt;, V&lt;sub&gt;DDA&lt;/sub&gt; and booster.
To avoid current consumption due to booster activation when V&lt;sub&gt;DDA&lt;/sub&gt; &lt; 2.7 V and V&lt;sub&gt;DD&lt;/sub&gt; &gt; 2.7 V, V&lt;sub&gt;DD&lt;/sub&gt; can be selected as supply voltage for analog switches. In this case, the BOOSTEN bit must be cleared to avoid unwanted power consumption.
When both V&lt;sub&gt;DD and &lt;/sub&gt;V&lt;sub&gt;DDA&lt;/sub&gt; are below 2.7 V, the booster is still needed to obtain full AC performances from the I/O analog switches.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ETH_PHYSEL</name>
              <description>Ethernet PHY interface selection
Other: reserved</description>
              <bitOffset>21</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>AXIRAM_WS</name>
              <description>AXIRAM wait state
Set this bit to add one wait state to all AXIRAMs when ECC = 0. When ECC = 1 there is one wait state by default.</description>
              <bitOffset>28</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FPUIMR</name>
          <displayName>FPUIMR</displayName>
          <description>SBS FPU interrupt mask register</description>
          <addressOffset>0x104</addressOffset>
          <size>0x20</size>
          <resetValue>0x0000001F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FPU_IE</name>
              <description>FPU interrupt enable
Set and cleared by software to enable the Cortex-M7 FPU interrupts
xxxxx1: Invalid operation interrupt enabled (xxxxx0 to disable)
xxxx1x: Divide-by-zero interrupt enabled (xxxx0x to disable)
xxx1xx: Underflow interrupt enabled (xxx0xx to disable)
xx1xxx: Overflow interrupt enabled (xx0xxx to disable)
x1xxxx: Input denormal interrupt enabled (x0xxxx to disable)
1xxxxx: Inexact interrupt enabled (0xxxxx to disable), disabled by default</description>
              <bitOffset>0</bitOffset>
              <bitWidth>6</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>MESR</name>
          <displayName>MESR</displayName>
          <description>SBS memory erase status register</description>
          <addressOffset>0x108</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>MEF</name>
              <description>memory erase flag
This bit is set by hardware when BKPRAM and PKA SRAM erase is ongoing after a POWER ON reset or one tamper event (see Section 50: Tamper and backup registers (TAMP) for details). This bit is cleared when the erase is done.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCCSR</name>
          <displayName>CCCSR</displayName>
          <description>SBS I/O compensation cell control and status register</description>
          <addressOffset>0x110</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>EN</name>
              <description>Compensation cell enable
Set this bit to enable the compensation cell.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>CS</name>
              <description>Compensation cell code selection
This bit selects the code to be applied for the I/O compensation cell.</description>
              <bitOffset>1</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCTO1_COMP_EN</name>
              <description>XSPIM_P1 compensation cell enable
Set this bit to enable the XSPIM_P1 compensation cell.</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCTO1_COMP_CODESEL</name>
              <description>XSPIM_P1 compensation cell code selection
This bit selects the code to be applied for the XSPIM_P1 I/O compensation cell.</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCTO2_COMP_EN</name>
              <description>XSPIM_P2 compensation cell enable
Set this bit to enable the XSPIM_P2 compensation cell.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCTO2_COMP_CODESEL</name>
              <description>XSPIM_P2 compensation cell code selection
This bit selects the code to be applied for the XSPIM_P2 I/O compensation cell.</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>READY</name>
              <description>Compensation cell ready
This bit provides the status of the compensation cell.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCTO1_COMP_RDY</name>
              <description>XSPIM_P1 compensation cell ready
This bit provides the status of the XSPIM_P1 compensation cell.</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCTO2_COMP_RDY</name>
              <description>XSPIM_P2 compensation cell ready
This bit provides the status of the XSPIM_P2 compensation cell.</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>HSLV</name>
              <description>I/O high speed at low voltage
When this bit is set, the speed of the I/Os is optimized when the device voltage is low.
This bit is active only if VDDIO_HSLV user option bit is set in FLASH. It must be used only if the device supply voltage is below 2.7 V. Setting this bit when V&lt;sub&gt;DD&lt;/sub&gt; is higher than 2.7 V may be destructive.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCTO1_IOHSLV</name>
              <description>XSPIM_P1 I/O high speed at low voltage 
When this bit is set, the speed of the XSPIM_P1 I/Os is optimized when the device voltage is low.
This bit is active only if OCTO1_HSLV user option bit is set in FLASH. This bit must be used only if the device supply voltage is below 2.7 V. Setting this bit when V&lt;sub&gt;DD&lt;/sub&gt; is higher than 2.7 V may be destructive.</description>
              <bitOffset>17</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>OCTO2_IOHSLV</name>
              <description>XSPIM_P2 I/O high speed at low voltage 
When this bit is set, the speed of the XSPIM_P2 I/Os is optimized when the device voltage is low.
This bit is active only if OCTO2_HSLV user option bit is set in FLASH. This bit must be used only if the device supply voltage is below 2.7 V. Setting this bit when V&lt;sub&gt;DD&lt;/sub&gt; is higher than 2.7 V may be destructive.</description>
              <bitOffset>18</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CCVALR</name>
          <displayName>CCVALR</displayName>
          <description>SBS compensation cell for I/Os value register</description>
          <addressOffset>0x114</addressOffset>
          <size>0x20</size>
          <resetValue>0x00000088</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>NSRC</name>
              <description>NMOS transistors slew-rate compensation
This bitfield returns the NMOS transistors slew-rate compensation value computed by the cell. It is interpreted to compensate the NMOS transistors slew rate in the functional range if COMP_CODESEL = 0 in SBS_CCCSR register.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PSRC</name>
              <description>PMOS transistors slew-rate compensation
This bitfield returns the PMOS transistors slew-rate compensation value computed by the cell. It is interpreted to compensate the PMOS transistors slew rate in the functional range if COMP_CODESEL = 0 in SBS_CCCSR register.</description>
              <bitOffset>4</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCTO1_NSRC</name>
              <description>XSPIM_P1 NMOS transistors slew-rate compensation
This bitfield returns the NMOS transistors slew-rate compensation value computed by the cell. It is interpreted by XSPIM_P1 to compensate the NMOS transistors slew rate in the functional range if OCTO1_COMP_CODESEL = 0 in SBS_CCCSR register.</description>
              <bitOffset>8</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCTO1_PSRC</name>
              <description>XSPIM_P1 PMOS transistors slew-rate compensation
This bitfield returns the PMOS transistors slew-rate compensation value computed by the cell. It is interpreted by XSPIM_P1 to compensate the PMOS transistors slew rate in the functional range if OCTO1_COMP_CODESEL = 0 in SBS_CCCSR register.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCTO2_NSRC</name>
              <description>XSPIM_P2 NMOS transistors slew-rate compensation
This bitfield returns the NMOS transistors slew-rate compensation value computed by the cell. It is interpreted by XSPIM_P2 to compensate the NMOS transistors slew rate in the functional range if OCTO2_COMP_CODESEL = 0 in SBS_CCCSR register.</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>OCTO2_PSRC</name>
              <description>XSPIM_P2 PMOS transistors slew-rate compensation
This bitfield returns the PMOS transistors slew-rate compensation value computed by the cell. It is interpreted by XSPIM_P2 to compensate the PMOS transistors slew rate in the functional range if OCTO2_COMP_CODESEL = 0 in SBS_CCCSR register.</description>
              <bitOffset>20</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
